mycraft/literate_setup.org
#+TITLE: Mycraft emacs' literate programming configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+DESCRIPTION: In other words, you write a document that describes your program and that document is also the source code for the program being described.

* Table of Contents :TOC:
- [[#what-is-this][What is this]]
- [[#setup][Setup]]
  - [[#grow-the-garbage-collection-threshold-when-initialize][grow the garbage collection threshold when initialize]]
  - [[#make-exec-path-is-matched-from-the-shells-path][make exec-path is matched from the shell's PATH]]
  - [[#set-up-config-home-directory][set up config home directory]]
  - [[#set-up-wher-the-packages-to-be-installed][set up wher the packages to be installed]]
- [[#ui-adjustment][UI adjustment]]
  - [[#make-curosr-in-the-help-window-at-first-when-poping-up-a-help-window][make curosr in the help window at first when poping up a help window]]
  - [[#disable-beep-when-moving-beyond-the-window][disable beep when moving beyond the window]]
  - [[#setup-for-ns-gui-system][setup for ns gui system]]
  - [[#minimize-ui-interface][minimize ui interface]]
  - [[#change-comment-highlight-and-org-block-color][change comment highlight and org-block color]]
  - [[#enable-highlight-current-line][enable highlight current line]]
- [[#font-setup--config-background-color][Font setup & config background color]]
- [[#misc-behaviro-setup][Misc Behaviro setup]]
  - [[#simplify-the-prompt-yes-or-no-to-y-or-n][simplify the prompt =yes or no= to =y or n=]]
  - [[#show-startup-message-and-make-all-the-icon-not-to-impact-performance][show startup message and make all-the-icon not to impact performance]]
  - [[#show-column-number-in-the-modeline][show column number in the modeline]]
  - [[#disable-backup-file-and-disable-tabs-always-using-space][disable backup file and disable tabs (always using space)]]
  - [[#set-default-indent-width][set default indent width]]
  - [[#some-settings-for-dired-mode][some settings for dired mode]]
  - [[#avoid-ffap-guesser-freeze-when-find-file-thing-at-point][avoid ffap-guesser freeze when find-file-thing-at-point]]
  - [[#setup-gpg][setup gpg]]
  - [[#customize-shell-prompt-way][customize shell prompt way]]
  - [[#disable-word-wrap][disable word wrap]]
  - [[#auto-revert-mode][auto revert mode]]
  - [[#turn-on-global-visual-line-mode][turn on global visual-line-mode]]
- [[#self-defined-helper-functions][Self defined helper functions]]
  - [[#an-helper-to-detect-os][an helper to detect os]]
  - [[#a-macro-function-helps-measuring-time-consuming][a macro function helps measuring time consuming]]
  - [[#switch-input-method-for-evil-mode][switch input method for evil mode]]
  - [[#util-helpers-to-be-completed][util helpers to be completed]]
  - [[#my-customize-docker-shell-with-vterm][my customize docker shell with vterm]]
  - [[#start-a-new-emacs-instance][start a new emacs instance]]
  - [[#text-encoding-decoding][text encoding decoding]]
  - [[#org-insert-toc][org-insert-toc]]
  - [[#org-journal-stock][org journal stock]]
  - [[#misc][misc]]
  - [[#lsp-keybinding][lsp-keybinding]]
  - [[#lsp-define-key-helper][lsp define key helper]]
  - [[#buffer-window-manipulation][buffer, window manipulation]]
  - [[#file-manipulation][file manipulation]]
  - [[#emmet][emmet]]
  - [[#flycheck][flycheck]]
  - [[#project-jump--comment][project jump & comment]]
  - [[#snippet][snippet]]
  - [[#xwidget-relevant-functions][xwidget relevant functions]]
  - [[#auto-tangle-literate-config][auto tangle literate config]]
  - [[#operation-with-marked-text][operation with marked text]]
  - [[#search-relevant-functions][search relevant functions]]
  - [[#yaml-indent-function][yaml indent function]]
  - [[#python-relevant][python relevant]]
  - [[#golang-relevant-helper][golang relevant helper]]
- [[#initialize-packages-and-setup-hook][Initialize packages and setup hook]]
  - [[#set-up-use-package][set up use-package]]
  - [[#try-out-straightel][try out straight.el]]
  - [[#add-additional-load-path-for-use-package][add additional load-path for use-package]]
  - [[#enable-link-in-the-comments-can-be-click-and-highlight][enable link in the comments can be click and highlight]]
  - [[#ensure-program-mode-use-space-instead-of-tab][ensure program mode use space instead of tab]]
  - [[#delete-trailing-space-when-saving-files][delete trailing space when saving files]]
  - [[#ensure-auto-refresh-buffer-for-dired-mode][ensure auto refresh buffer for dired mode]]
  - [[#winner-mode][winner mode]]
  - [[#dired][dired]]
  - [[#esup][esup]]
  - [[#svg-lib][svg-lib]]
  - [[#diminish][diminish]]
  - [[#command-log-mode][command-log-mode]]
  - [[#rainbow-mode][rainbow-mode]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#highlight-parentheses][highlight parentheses]]
  - [[#doom-themes][doom-themes]]
  - [[#doom-modeline][doom modeline]]
  - [[#all-the-icons][all-the-icons]]
  - [[#polymode][polymode]]
  - [[#devdocs][devdocs]]
  - [[#counsel-jq-yq][counsel-jq-yq]]
  - [[#go-test][go-test]]
  - [[#hl-todo-mode][hl-todo mode]]
  - [[#diff-hl][diff-hl]]
  - [[#perspective-mode][perspective mode]]
  - [[#which-key-mode][which key mode]]
  - [[#dictonary-relevant-packages][dictonary relevant packages]]
  - [[#notification][notification]]
  - [[#ebook-reader][ebook reader]]
  - [[#uuidgen][uuidgen]]
  - [[#docker][docker]]
  - [[#nginx][nginx]]
  - [[#jsonnet-mode][jsonnet-mode]]
  - [[#conf-mode][conf-mode]]
  - [[#jinja2-mode][jinja2-mode]]
  - [[#makefile-mode][makefile-mode]]
  - [[#racket-mode][racket-mode]]
  - [[#smartparens][smartparens]]
  - [[#yasnippet][yasnippet]]
  - [[#helpful][helpful]]
  - [[#expand-region][expand-region]]
  - [[#winum][winum]]
  - [[#systemd][systemd]]
  - [[#frontend-development][frontend development]]
  - [[#flycheck-mode][flycheck mode]]
  - [[#json-mode--yaml-mode][json-mode & yaml-mode]]
  - [[#cmake][cmake]]
  - [[#lua][lua]]
  - [[#common-lisp-or-emacs-lisp][common lisp or emacs lisp]]
  - [[#rust-mode][rust mode]]
  - [[#go-mode][go mode]]
  - [[#python-mode][python mode]]
  - [[#dumb-jump][dumb-jump]]
  - [[#lsp-mode][lsp mode]]
  - [[#ivy--swiper--counsel][ivy & swiper & counsel]]
  - [[#projectile][projectile]]
  - [[#avy][avy]]
  - [[#vterm][vterm]]
  - [[#ediff][ediff]]
  - [[#evil][evil]]
  - [[#wgrep-mode][wgrep mode]]
  - [[#code-folding][code folding]]
  - [[#multiple-cursors][multiple-cursors]]
  - [[#git-version-control][git version control]]
  - [[#auto-highlight-symbol][auto-highlight-symbol]]
  - [[#general][general]]
  - [[#hydra][hydra]]
  - [[#company][company]]
  - [[#org][org]]
- [[#some-key-binding][Some key binding]]
- [[#tips][Tips]]

* What is this

  It's a documentation of my emacs configs and is also a emacs lisp code for my emacs setup.
  This is powered by the =emacs-babel-tangle=. To generate the [[file:init.el][init.el]]. just run it.
  Thanks for the awesome [[https://github.com/syl20bnr/spacemacs][spacemacs]]. I borrow some util function from it :)

* Setup

  Put =-*- lexical-binding: t; -*-= in the beginning of the file. This way, we don't need to call =(setq lexical-binding t)=.

  [[https://github.com/syl20bnr/spacemacs/blob/c7a103a772d808101d7635ec10f292ab9202d9ee/layers/%2Bdistributions/spacemacs-base/config.el][spacemacs config source code]]
  tips for optimization https://github.com/nilcons/emacs-use-package-fast

  https://www.gnu.org/software/emacs/manual/html_node/eintr/debug_002don_002dentry.html
  another debug way

  #+begin_src emacs-lisp
    ;;; mycraft --- Summary  -*- lexical-binding: t; -*-
    ;;; Copyright (C) 2020 mycraft maintainers
    ;;; Author: Jing
    ;;; package --- mycraft
    ;;; Commentary:

    ;;; Code:

    ;; (toggle-debug-on-error) temporarily for debug usage

  #+end_src

** grow the garbage collection threshold when initialize
   this will make it high performance because of lower gc times.

   #+begin_src emacs-lisp
     (setq gc-cons-threshold 64000000)
     ;;(add-hook 'after-init-hook #'(lambda ()
                                    ;; restore after startup
     ;;                               (setq gc-cons-threshold 800000)))
   #+end_src

** make exec-path is matched from the shell's PATH

   #+begin_src emacs-lisp
     (defun do-something (process signal)
       (when (memq (process-status process) '(exit signal))
         (let* ((buf (process-buffer process))
                (content (with-current-buffer buf
                           (buffer-substring-no-properties (point-min) (point-max))))
                (path-from-shell (replace-regexp-in-string
                                  "[ \t\n]*" ""
                                  content)))

           (setenv "PATH" path-from-shell)
           (setq exec-path (split-string path-from-shell path-separator)))

         (shell-command-sentinel process signal)))


     (add-hook 'emacs-startup-hook
               #'(lambda ()

                   (let* ((display-buffer-alist '(("*my async shell command*" display-buffer-no-window)))
                          (output-buffer (generate-new-buffer "*my async shell command*"))
                          (proc (progn
                                  (async-shell-command "$SHELL --login -c 'echo $PATH'" output-buffer)
                                  (get-buffer-process output-buffer))))
                     (if (process-live-p proc)
                         (set-process-sentinel proc #'do-something)
                       (message "No process running.")))))

   #+end_src

** set up config home directory
   #+begin_src emacs-lisp
     (defconst my-home-dir "~/.mycraft.d")
     (setq user-emacs-directory my-home-dir)
   #+end_src

** set up wher the packages to be installed
   #+begin_src emacs-lisp
     (setq package-user-dir (concat my-home-dir "/" "elpa"))
     (setq mc/list-file (concat my-home-dir "/" "mc-lists.el"))
   #+end_src

* UI adjustment

  =custom-theme-directory=

  #+begin_src emacs-lisp
    (setq frame-title-format "") ;; to disable show buffer name in the title bar
    ;; (force-mode-line-update) to update the frame title
    (setq scroll-conservatively 101) ;; to prevent recenter when cursor moves out of screen
    (setq scroll-preserve-screen-position t)
    (setq auto-window-vscroll nil)
    (setq warning-minimum-level :error) ;; to supress the pop-up window of warning message
  #+end_src

** make curosr in the help window at first when poping up a help window

   #+begin_src emacs-lisp
     (setq help-window-select t)
   #+end_src

** disable beep when moving beyond the window
   #+begin_src emacs-lisp
     (setq ring-bell-function 'ignore)
   #+end_src

** setup for ns gui system
   #+begin_src emacs-lisp
     (when (eq (window-system) 'ns)
       (setq mac-command-modifier 'meta)
       ;; force to set command key to meta. In other emacs varaint like emacs-plus, the key is defined to =super=
       (setq frame-resize-pixelwise t)
       ;; make sure full maximized frame. It will not occupied the full screen in cocoa version.
       (setq ns-use-proxy-icon nil) ;; disable show icon in the title bar
       (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t)))
   #+end_src

** minimize ui interface

   We can adjust the ui by setting the =default-frame-alist=. The following settings are found in the source code.

   | function             | frame-alist                            |
   |----------------------+----------------------------------------|
   | (scroll-bar-mode -1) | '(vertical-scroll-bars)                |
   | (menu-bar-mode -1)   | '(menu-bar-lines . 0)                  |
   | (tool-bar-mode -1)   | '(tool-bar-lines . 0)                  |
   | (set-fringe-mode 5)  | '(left-fringe . 5) '(right-fringe . 5) |
   | toggle-fullscreen    | '(fullscreen . maximized)              |


   #+begin_src emacs-lisp
     (add-to-list 'default-frame-alist '(vertical-scroll-bars))
     (add-to-list 'default-frame-alist '(menu-bar-lines . 0))
     (add-to-list 'default-frame-alist '(tool-bar-lines . 0))
     (add-to-list 'default-frame-alist '(left-fringe . 5))
     (add-to-list 'default-frame-alist '(right-fringe . 5))
     (add-to-list 'default-frame-alist '(fullscreen . maximized))
     ;; (add-to-list 'default-frame-alist '(background-color . "#292b2e")) ;; this will be overwrite by doom-themes
     (add-to-list 'default-frame-alist '(font . "Source Code Pro-15"))
   #+end_src

** change comment highlight and org-block color

   #+begin_src emacs-lisp
     (with-eval-after-load 'goto-addr
       (set-face-attribute 'link nil :foreground "#3f7c8f"))
   #+end_src

** enable highlight current line
   enable for prog-mode and text-mode

   jinja2 is the child of text-mode so it's no need to set up for this again.

   #+begin_src emacs-lisp :tangle no
     (with-eval-after-load 'jinja2-mode
       (add-hook 'jinja2-mode-hook 'hl-line-mode))
   #+end_src

   #+begin_src emacs-lisp
     (add-hook 'prog-mode-hook 'hl-line-mode)
     (add-hook 'text-mode-hook 'hl-line-mode)
   #+end_src

* Font setup & config background color

  #+begin_src emacs-lisp
    (setq default-font-size 140)
    (set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height default-font-size)
    (set-face-attribute 'variable-pitch nil :font "Source Code Pro" :height 140 :weight 'regular)
  #+end_src

* Misc Behaviro setup

