mycraft/literate_setup.org
** simplify the prompt =yes or no= to =y or n=

   fset can set symbol's function definition.

   ex.
   #+begin_example
     (fset 'abc #'(lambda () (message "hi")))
     (abc) ;; you can call it like function
     ;; You call not direct call it like this if you use (setq 'abc '...)
   #+end_example

   #+begin_src emacs-lisp
     (fset 'yes-or-no-p 'y-or-n-p) ;; to simplify the yes or no input
   #+end_src

** show startup message and make all-the-icon not to impact performance
   #+begin_src emacs-lisp
     (setq inhibit-startup-message t)
     (setq inhibit-compacting-font-caches t) ;; for all-the-icon slow issue
   #+end_src

** show column number in the modeline

   #+begin_src emacs-lisp
     (setq column-number-mode t)
   #+end_src

** disable backup file and disable tabs (always using space)
   #+begin_src emacs-lisp
     (setq make-backup-files nil)
     (setq-default indent-tabs-mode nil)
     (setq xwidget-webkit-enable-plugins t) ;; what does this impact?
   #+end_src

** set default indent width

   NOTE: If you use setq here, it will not works. To research why

   #+begin_src emacs-lisp
     (setq-default tab-width 4)
   #+end_src

** some settings for dired mode

   #+begin_src emacs-lisp
     (when (string= system-type "darwin")
       "In macos, ls doesn't support --dired option"
       (setq dired-use-ls-dired nil))
   #+end_src

   Make dired auto guess the path to rename
   When opening two buffer with dired mode, you will get pre-defined path for renaming.

   #+begin_src emacs-lisp
     (setq dired-dwim-target t)
   #+end_src

   Enable edit file's permissions in the wdired-mode

   #+begin_src emacs-lisp
     (setq wdired-allow-to-change-permissions t)
   #+end_src

   Make deleting the files in the dired by moving to trash instead of deleting directly.

   #+begin_src emacs-lisp
     (setq delete-by-moving-to-trash t)
   #+end_src

   If you want to extend the support compress method for dired mode, you can customize =dired-compress-files-alist= variable.
   press =Z= to uncompress

** avoid ffap-guesser freeze when find-file-thing-at-point

   This will happend when find-file under a url-like thing. It can disable ping the target url to avoid
   freezing.

   #+begin_src emacs-lisp
     (setq ffap-machine-p-known 'reject)
   #+end_src

** setup gpg

   #+begin_src emacs-lisp
     (setq epg-pinentry-mode 'loopback)
     (setq epa-file-encrypt-to '("sillygod"))
   #+end_src

** customize shell prompt way

   https://stackoverflow.com/questions/6411121/how-to-make-emacs-use-my-bashrc-file
   in order to make the shell to load source file
   this will cause a side effect to slow down projectile-project-file
   projectile-dir-files-alien
   issue: https://github.com/syl20bnr/spacemacs/issues/4207
   (setq shell-file-name "/bin/bash")
   (setq shell-command-switch "-ic")

   #+begin_src emacs-lisp
     (setq shell-command-switch "-c")
   #+end_src

** disable word wrap
   inspect the source of =(toggle-word-wrap 0)= and find set =word-wrap= to nil can
   achieve this function.

   #+begin_src emacs-lisp
     (setq word-wrap nil)
   #+end_src

** auto revert mode
   auto refresh when moving file or rename file in dired mode, reread buffer when the file is changed.

   #+begin_src emacs-lisp
     (global-auto-revert-mode t)
   #+end_src

** turn on global visual-line-mode

   #+begin_src emacs-lisp
     (global-visual-line-mode 1)
   #+end_src

* Self defined helper functions

** an helper to detect os

   #+begin_src emacs-lisp
     (defun system-is-mac! ()
       (eq system-type 'darwin))

     (defun system-is-linux! ()
       (eq system-type 'gnu/linux))

     (defun system-is-windows ()
       (eq system-type 'windows-nt))
   #+end_src

** a macro function helps measuring time consuming
   #+begin_src emacs-lisp
     (defmacro measure-time (&rest body)
       `(let ((time (current-time)))
          ,@body
          (message "%.06f s" (float-time (time-since time)))))


     ;; TODO: find a way to handle this better
     (add-hook 'org-babel-pre-tangle-hook #'(lambda ()
                                              (setq-default evil-normal-state-entry-hook nil)
                                              (setq-default evil-insert-state-entry-hook nil)
                                              (setq-default evil-insert-state-exit-hook nil)
                                              (setq-default evil-emacs-state-entry-hook nil)))


     (add-hook 'org-babel-post-tangle-hook #'(lambda ()
                                               (add-hook 'evil-normal-state-entry-hook 'im-use-eng)
                                               (add-hook 'evil-insert-state-entry-hook 'im-use-prev)
                                               (add-hook 'evil-insert-state-exit-hook 'im-remember)
                                               (add-hook 'evil-emacs-state-entry-hook 'im-use-eng)))

     (defun measure-org-babel-tangle ()
       "A simple wrap to measure org-babel-tangle."
       (interactive)
       (when (fboundp 'profiler-stop)
         (profiler-stop))
       (profiler-start 'cpu+mem)
       (setq temp emacs-lisp-mode-hook)
       (setq-default emacs-lisp-mode-hook nil)
       (measure-time (org-babel-tangle))
       (setq-default emacs-lisp-mode-hook temp)
       (profiler-report))

   #+end_src

** switch input method for evil mode

   *need to install the package [[https://github.com/daipeihust/im-select][im-select]]*
   TODO: refactor this auto switch input method function into another file.

   #+begin_src emacs-lisp
     (defcustom im-exec "/usr/local/bin/im-select"
       "The im executable binary path."
       :type 'string)

     (defvar default-im "com.apple.keylayout.ABC"
       "Default English input method.")

     (defvar prev-im ""
       "previous input method.")

     (defvar current-im ""
       "Current input method.")

     (defun im-use-eng ()
       "Switch to english input method."
       (interactive)
       (cond ((and (string= system-type "darwin")
                   (not (string= current-im default-im)))
              (call-process-shell-command (concat im-exec " " default-im))
              (setq current-im default-im))))

     (defun im-remember ()
       "Remember the input method being used in insert mode."
       (interactive)
       (cond ((string= system-type "darwin")
              (setq prev-im (substring (shell-command-to-string im-exec) 0 -1))
              (setq current-im prev-im))))

     (defun im-use-prev ()
       "Change the input method to the previous one we remembered."
       (interactive)
       (cond ((string= system-type "darwin")
              (if prev-im
                  (progn
                    (call-process-shell-command (concat im-exec " " prev-im))
                    (setq current-im prev-im))
                (progn
                  (call-process-shell-command (concat im-exec " " default-im))
                  (setq current-im default-im))))))
   #+end_src

