mycraft/init.el

(fset 'yes-or-no-p 'y-or-n-p) ;; to simplify the yes or no input

(setq inhibit-startup-message t)
(setq inhibit-compacting-font-caches t) ;; for all-the-icon slow issue

(setq column-number-mode t)

(setq make-backup-files nil)
(setq-default indent-tabs-mode nil)
(setq xwidget-webkit-enable-plugins t) ;; what does this impact?

(setq-default tab-width 4)

(setq dired-dwim-target t)

(setq wdired-allow-to-change-permissions t)

(setq delete-by-moving-to-trash t)

(setq ffap-machine-p-known 'reject)

(setq epg-pinentry-mode 'loopback)
(setq epa-file-encrypt-to '("sillygod"))

(setq shell-command-switch "-c")

(setq word-wrap nil)

(global-auto-revert-mode t)

(global-visual-line-mode 1)

(defun system-is-mac! ()
  (eq system-type 'darwin))

(defun system-is-linux! ()
  (eq system-type 'gnu/linux))

(defun system-is-windows ()
  (eq system-type 'windows-nt))

(defmacro measure-time (&rest body)
  `(let ((time (current-time)))
     ,@body
     (message "%.06f s" (float-time (time-since time)))))


;; TODO: find a way to handle this better
(add-hook 'org-babel-pre-tangle-hook '(lambda ()
                                        (setq-default evil-normal-state-entry-hook nil)
                                        (setq-default evil-insert-state-entry-hook nil)
                                        (setq-default evil-insert-state-exit-hook nil)
                                        (setq-default evil-emacs-state-entry-hook nil)))


(add-hook 'org-babel-post-tangle-hook '(lambda ()
                                         (add-hook 'evil-normal-state-entry-hook 'im-use-eng)
                                         (add-hook 'evil-insert-state-entry-hook 'im-use-prev)
                                         (add-hook 'evil-insert-state-exit-hook 'im-remember)
                                         (add-hook 'evil-emacs-state-entry-hook 'im-use-eng)))

(defun measure-org-babel-tangle ()
  "A simple wrap to measure org-babel-tangle."
  (interactive)
  (when (fboundp 'profiler-stop)
    (profiler-stop))
  (profiler-start 'cpu+mem)
  (setq temp emacs-lisp-mode-hook)
  (setq-default emacs-lisp-mode-hook nil)
  (measure-time (org-babel-tangle))
  (setq-default emacs-lisp-mode-hook temp)
  (profiler-report))

(defcustom im-exec "/usr/local/bin/im-select"
  "The im executable binary path."
  :type 'string)

(defvar default-im "com.apple.keylayout.ABC"
  "Default English input method.")

(defun im-use-eng ()
  "Switch to english input method."
  (interactive)
  (cond ((string= system-type "darwin")
         (call-process-shell-command (concat im-exec " " default-im)))))

(defun im-remember ()
  "Remember the input method being used in insert mode."
  (interactive)
  (unless (boundp 'prev-im)
    (setq prev-im (substring (shell-command-to-string im-exec) 0 -1)))
  (cond ((string= system-type "darwin")
         (setq prev-im (substring (shell-command-to-string im-exec) 0 -1)))))

(defun im-use-prev ()
  "Change the input method to the previous one we remembered."
  (interactive)
  (unless (boundp 'prev-im)
    (setq prev-im (substring (shell-command-to-string im-exec) 0 -1)))
  (cond ((string= system-type "darwin")
         (if prev-im
             (call-process-shell-command (concat im-exec " " prev-im))
           (call-process-shell-command (concat im-exec " " default-im))))))
