mycraft/literate_setup.org
** util helpers to be completed
   #+begin_src emacs-lisp
     ;; NOTE: borrow from spacemacs
     (defun show-hide-helm-or-ivy-prompt-msg (msg sec)
       "Show a MSG at the helm or ivy prompt for SEC.
          With Helm, remember the path, then restore it after SEC.
          With Ivy, the path isn't editable, just remove the MSG after SEC."
       (run-at-time
        0 nil
        #'(lambda (msg sec)
            (let* ((prev-prompt-contents
                    (buffer-substring (line-beginning-position)
                                      (line-end-position)))
                   (prev-prompt-contents-p
                    (not (string= prev-prompt-contents ""))))
              (when prev-prompt-contents-p
                (delete-region (line-beginning-position)
                               (line-end-position)))
              (insert (propertize msg 'face 'warning))
              ;; stop checking for candidates
              ;; and update the helm prompt
              (sit-for sec)
              (delete-region (line-beginning-position)
                             (line-end-position))
              (when prev-prompt-contents-p
                (insert prev-prompt-contents)
                ;; start checking for candidates
                ;; and update the helm prompt
                )))
        msg sec))

     ;; NOTE: borrow from spacemacs
     (defun rename-current-buffer-file (&optional arg)
       "Rename the current buffer and the file it is visiting.
     If the buffer isn't visiting a file, ask if it should
     be saved to a file, or just renamed.

     If called without a prefix argument, the prompt is
     initialized with the current directory instead of filename."
       (interactive "P")
       (let* ((old-short-name (buffer-name))
              (old-filename (buffer-file-name)))
         (if (and old-filename (file-exists-p old-filename))
             ;; the buffer is visiting a file
             (let* ((old-dir (file-name-directory old-filename))
                    (new-name (read-file-name "New name: " (if arg old-dir old-filename)))
                    (new-dir (file-name-directory new-name))
                    (new-short-name (file-name-nondirectory new-name))
                    (file-moved-p (not (string-equal new-dir old-dir)))
                    (file-renamed-p (not (string-equal new-short-name old-short-name))))
               (cond ((get-buffer new-name)
                      (error "A buffer named '%s' already exists!" new-name))
                     ((string-equal new-name old-filename)
                      (show-hide-helm-or-ivy-prompt-msg
                       "Rename failed! Same new and old name" 1.5)
                      (rename-current-buffer-file))
                     (t
                      (let ((old-directory (file-name-directory new-name)))
                        (when (and (not (file-exists-p old-directory))
                                   (yes-or-no-p
                                    (format "Create directory '%s'?" old-directory)))
                          (make-directory old-directory t)))
                      (rename-file old-filename new-name 1)
                      (rename-buffer new-name)
                      (set-visited-file-name new-name)
                      (set-buffer-modified-p nil)
                      (when (fboundp 'recentf-add-file)
                        (recentf-add-file new-name)
                        (recentf-remove-if-non-kept old-filename))
                      (when (and (featurep 'projectile)
                                 (projectile-project-p))
                        (call-interactively #'projectile-invalidate-cache))
                      (message (cond ((and file-moved-p file-renamed-p)
                                      (concat "File Moved & Renamed\n"
                                              "From: " old-filename "\n"
                                              "To:   " new-name))
                                     (file-moved-p
                                      (concat "File Moved\n"
                                              "From: " old-filename "\n"
                                              "To:   " new-name))
                                     (file-renamed-p
                                      (concat "File Renamed\n"
                                              "From: " old-short-name "\n"
                                              "To:   " new-short-name)))))))
           ;; the buffer is not visiting a file
           (let ((key))
             (while (not (memq key '(?s ?r)))
               (setq key (read-key (propertize
                                    (format
                                     (concat "Buffer '%s' is not visiting a file: "
                                             "[s]ave to file or [r]ename buffer?")
                                     old-short-name)
                                    'face 'minibuffer-prompt)))
               (cond ((eq key ?s)            ; save to file
                      ;; this allows for saving a new empty (unmodified) buffer
                      (unless (buffer-modified-p) (set-buffer-modified-p t))
                      (save-buffer))
                     ((eq key ?r)            ; rename buffer
                      (let ((new-buffer-name (read-string "New buffer name: ")))
                        (while (get-buffer new-buffer-name)
                          ;; ask to rename again, if the new buffer name exists
                          (if (yes-or-no-p
                               (format (concat "A buffer named '%s' already exists: "
                                               "Rename again?")
                                       new-buffer-name))
                              (setq new-buffer-name (read-string "New buffer name: "))
                            (keyboard-quit)))
                        (rename-buffer new-buffer-name)
                        (message (concat "Buffer Renamed\n"
                                         "From: " old-short-name "\n"
                                         "To:   " new-buffer-name))))
                     ;; ?\a = C-g, ?\e = Esc and C-[
                     ((memq key '(?\a ?\e)) (keyboard-quit))))))))
   #+end_src

** my customize docker shell with vterm

   #+begin_src emacs-lisp
     (defun docker-container-vterm (container &optional read-shell)
       "Open `shell' in CONTAINER.  When READ-SHELL is not nil, ask the user for it."
       (interactive (list
                     (docker-container-read-name)
                     current-prefix-arg))
       (let* ((shell-file-name (docker-container--read-shell read-shell))
              (container-address (format "docker:%s:/" container))
              (file-prefix (let ((prefix (file-remote-p default-directory)))
                             (if prefix
                                 (format "%s|" (s-chop-suffix ":" prefix))
                               "/")))
              (default-directory (format "%s%s" file-prefix container-address)))
         (vterm-toggle-cd)))

     ;; (vterm-other-window (buffer-name (docker-generate-new-buffer "vterm" default-directory)))

   #+end_src

** start a new emacs instance
   https://www.gnu.org/software/emacs/manual/html_node/elisp/Command_002dLine-Arguments.html#index-command_002dline_002dargs
   how to get the argv

   #+begin_src emacs-lisp

     (defun restart-emacs-procedure ()
       (call-process "bash"
                     nil
                     nil
                     nil
                     "-c"
                     (concat
                      (elt command-line-args 0)
                      " -Q --load /Users/jing/Desktop/spacemacs-private/mycraft/init.el &")))


     (defun restart-emacs ()
       "Kill the original instance and start a new emacs instance.
     However, have no idea how to get the original instance' starting command args
     sys.args?"
       (interactive)
       (add-to-list 'kill-emacs-hook #'restart-emacs-procedure)
       (print kill-emacs-hook)
       (save-buffers-kill-emacs))
   #+end_src

