mycraft/init.el

(defun copy-region-and-base64-decode (start end)
  (interactive "r")
  (let ((x (base64-decode-string
            (decode-coding-string
             (buffer-substring start end) 'utf-8))))
    (kill-new x)))

(defun my-encode-region-base64 (start end)
  (interactive "r")
  (let ((content (buffer-substring-no-properties start end)))
    (when (use-region-p)
      (delete-region start end)
      (insert (base64-encode-string (encode-coding-string content 'utf-8))))))

(defun my-decode-region-base64 (start end)
  (interactive "r")
  (let ((content (buffer-substring-no-properties start end)))
    (when (use-region-p)
      (delete-region start end)
      (insert (base64-decode-string (decode-coding-string content 'utf-8))))))

(defun copy-region-and-urlencode (start end)
  (interactive "r")
  (let ((x (url-hexify-string
            (buffer-substring start end))))
    (kill-new x)))

(defun org-insert-toc ()
  "Insert table of content for org mode."
  (interactive)
  (beginning-of-line)
  (insert "*" " " ":TOC:")
  (backward-char 5)
  (evil-insert-state))

(defun hey-god (question)
  "Reduce distraction when you search the answer for the question.
                    Powered by the howdoi"
  (interactive "sAsk the god, you'll get it: ")
  (let ((buffer-name "*God's reply*")
        (exectuable-name "howdoi"))
    (with-output-to-temp-buffer buffer-name
      (shell-command (concat exectuable-name " " question)
                     buffer-name
                     "*Messages*")
      (pop-to-buffer buffer-name))))

(defun now ()
  "Get the current time, In the future this will show a temp buffer
with unix format, human readable and the weather info."
  (interactive)
  (message "now: %s \ntimestamp: %s" (format-time-string "%Y-%m-%d %H:%m:%S %z") (format-time-string "%s")))

(defun evil-smart-doc-lookup ()
  "Run documentation lookup command specific to the major mode.
          Use command bound to `SPC m h h` if defined, otherwise fall back
          to `evil-lookup'"
  (interactive)
  (when (fboundp 'lsp-describe-thing-at-point)
    (lsp-describe-thing-at-point)
    (evil-lookup)))

(defun org-mode-visual-fill ()
  "A beautiful word wrap effect."
  (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust))

(defun lsp-keybinding ()
  "Return the keybinding for lsp functions."
  (list "=" "format" nil
        "==" "lsp-format-buffer" 'lsp-format-buffer
        "=r" "lsp-format-region" 'lsp-format-region

        "a" "code actions" nil
        "aa" "lsp-execute-code-action" 'lsp-execute-code-action
        "al" "lsp-avy-lens" 'lsp-avy-lens
        "ah" "lsp-document-highlight" 'lsp-document-highlight

        "F" "folder" nil
        "Fa" "lsp-workspace-folders-add" 'lsp-workspace-folders-add
        "Fr" "lsp-workspace-folders-remove " 'lsp-workspace-folders-remove
        "Fb" "lsp-workspace-blacklist-remove" 'lsp-workspace-blacklist-remove

        "g" "goto" nil
        "gg" "lsp-find-definition" 'lsp-find-definition
        "gr" "lsp-find-references" 'lsp-find-references
        "gi" "lsp-find-implementation" 'lsp-find-implementation
        "gt" "lsp-find-type-definition" 'lsp-find-type-definition
        "gd" "lsp-find-declaration" 'lsp-find-declaration
        "ga" "xref-find-apropos" 'xref-find-apropos

        "G" "peek" nil
        "Gg" "lsp-ui-peek-find-definitions" 'lsp-ui-peek-find-definitions
        "Gr" "lsp-ui-peek-find-references" 'lsp-ui-peek-find-references
        "Gi" "lsp-ui-peek-find-implementatio" 'lsp-ui-peek-find-implementation
        "Gs" "lsp-ui-peek-find-workspace-symbol" 'lsp-ui-peek-find-workspace-symbol


        "h" "help" nil
        "hh" "lsp-describe-thing-at-point" 'lsp-describe-thing-at-point
        "hs" "lsp-signature-activate" 'lsp-signature-activate
        "hg" "lsp-ui-doc-glance" 'lsp-ui-doc-glance

        "r" "refactor" nil
        "rr" "lsp-rename" 'lsp-rename
        "ro" "lsp-organize-imports" 'lsp-organize-imports


        "T" "toggle" nil
        "Tl" "lsp-lens-mode" 'lsp-lens-mode
        "TL" "lsp-toggle-trace-io" 'lsp-toggle-trace-io
        "Th" "lsp-toggle-symbol-highlight" 'lsp-toggle-symbol-highlight
        "TS" "lsp-ui-sideline-mode" 'lsp-ui-sideline-mode
        "Td" "lsp-ui-doc-mode" 'lsp-ui-doc-mode
        "Ts" "lsp-toggle-signature-auto-activate" 'lsp-toggle-signature-auto-activate))

(defun define-leader-key-global (&rest MAPS)
  (let ((get-props (lambda () (list
                               my-leader-def-prop
                               my-leader-def-emacs-state-prop))))
    (dolist (prop (funcall get-props))
      (apply 'general-define-key
             :states (plist-get prop ':states)
             :prefix (symbol-value (plist-get prop ':key))
             :keymaps 'override
             MAPS))))

(defun define-leader-key-map-for (mode-map &rest MAPS)
  "Define the leader key map for the specify mode.
key desc binding."
  (let ((get-props (lambda () (list
                               my-local-leader-def-emacs-state-prop
                               my-local-leader-def-prop
                               my-local-leader-def-alias-prop))))


    (dolist (prop (funcall get-props))

      (cl-loop
       for (key desc binding)
       on MAPS by #'cdddr
       do

       (let ((mode (intern (string-remove-suffix "-map" (symbol-name mode-map))))
             (shortcut-key (concat (symbol-value (plist-get prop ':key)) key))
             (shortcut (kbd (concat (symbol-value (plist-get prop ':key)) key)))
             (sts (plist-get prop ':states)))

         (if (not (equal binding 'lsp-command-map))
             (apply 'general-define-key
                    :states sts
                    :prefix (symbol-value (plist-get prop ':key))
                    :keymaps mode-map
                    (if (equal binding nil)
                        (list key (list :ignore t :which-key desc))
                      (list key (list binding :which-key desc))))


           ;; if using the lexcial binding, we need to add a wrap to
           ;; bind the varaibles
           ((lambda (sts kmap keybinding func)
              (message "evil this fucking thing!!")
              (print kmap)
              (print sts)
              (print keybinding)
              (print func)
              (evil-define-key sts kmap keybinding func))
            sts mode-map
            (kbd (symbol-value (plist-get prop ':key)))
            binding)))))))
