mycraft/literate_setup.org
** buffer, window manipulation
   #+begin_src emacs-lisp
     (defun switch-to-minibuffer-window ()
       "Switch to minibuffer window (if active)."
       (interactive)
       (when (active-minibuffer-window)
         (select-window (active-minibuffer-window))))

     (defun toggle-maximize-buffer ()
       "Maximize buffer."
       (interactive)
       (save-excursion
         (if (and (= 1 (length (window-list)))
                  (assoc ?_ register-alist))
             (jump-to-register ?_)
           (progn
             (window-configuration-to-register ?_)
             (delete-other-windows)))))

     (defun org-file-show-headings (org-file)
       (interactive)
       (find-file (expand-file-name org-file))
       (counsel-org-goto)
       (org-overview)
       (org-reveal)
       (org-show-subtree)
       (forward-line))

     (defun buffer-untabify ()
       "Transfer all tab to spaces."
       (interactive)
       (mark-whole-buffer)
       (untabify (region-beginning) (region-end)))

     (defun new-empty-buffer ()
       "Create a new buffer called: untitled."
       (interactive)
       (let ((newbuf (generate-new-buffer "untitled")))

         ;; Prompt to save on `save-some-buffers' with positive PRED
         (with-current-buffer newbuf
           (setq-local buffer-offer-save t))
         ;; pass non-nil force-same-window to prevent `switch-to-buffer' from
         ;; displaying buffer in another window
         (switch-to-buffer newbuf nil 'force-same-window)))

     (defun rotate-windows-forward (count)
       "Rotate each window forwards.
                         A negative prefix argument rotates each window backwards.
                         Dedicated (locked) windows are left untouched."
       (interactive "p")
       (let* ((non-dedicated-windows (cl-remove-if 'window-dedicated-p (window-list)))
              (states (mapcar #'window-state-get non-dedicated-windows))
              (num-windows (length non-dedicated-windows))
              (step (+ num-windows count)))
         (if (< num-windows 2)
             (error "You can't rotate a single window!")
           (dotimes (i num-windows)
             (window-state-put
              (elt states i)
              (elt non-dedicated-windows (% (+ step i) num-windows)))))))


     (defun my-shrink-window (delta)
       "Shrink-window."
       (interactive "p")
       (shrink-window delta))

     (defun my-shrink-window-horizontally (delta)
       "Shrink-window."
       (interactive "p")
       (shrink-window delta t))


     (defun my-enlarge-window (delta)
       (interactive "p")
       (enlarge-window delta))

     (defun my-enlarge-window-horizontally (delta)
       (interactive "p")
       (enlarge-window delta t))

     (defun kill-this-buffer (&optional arg)
       "Kill the current buffer.
               ARG is an universal arg which will kill the window as well.
               If the universal prefix argument is used then kill also the window."
       (interactive "P")
       (if (window-minibuffer-p)
           (abort-recursive-edit)
         (if (equal '(4) arg)
             (kill-buffer-and-window)
           (kill-buffer))))

     (defun copy-file-path ()
       "Copy and show the file path of the current buffer."
       (interactive)
       (if-let (file-path (get-file-path))
           (progn
             (kill-new file-path)
             (message "%s" file-path))
         (message "WARNING: Current buffer is not attached to a file!")))
   #+end_src

** file manipulation
   #+begin_src emacs-lisp
     (defun get-file-path ()
       "Retrieve the file path of the current buffer.

     Returns:
       - A string containing the file path in case of success.
       - `nil' in case the current buffer does not have a directory."
       (when-let (file-path (buffer-file-name))
         (file-truename file-path)))

   #+end_src

** emmet
   #+begin_src emacs-lisp
     (defun my-emmet-expand ()
       (interactive)
       (unless (if (bound-and-true-p yas-minor-mode)
                   (call-interactively 'emmet-expand-yas)
                 (call-interactively 'emmet-expand-line))
         (indent-for-tab-command)))
   #+end_src

** flycheck
   #+begin_src emacs-lisp
     (defun toggle-flycheck-error-list ()
       "Toggle flycheck's error list window.
     If the error list is visible, hide it.  Otherwise, show it."
       (interactive)
       (-if-let (window (flycheck-get-error-list-window))
           (quit-window nil window)
         (flycheck-list-errors)))
   #+end_src

** project jump & comment
   #+begin_src emacs-lisp
     (defun comment-or-uncomment-lines (&optional arg)
       (interactive "p")
       (evilnc-comment-or-uncomment-lines arg))

     (defun counsel-jump-in-buffer ()
       "Jump in buffer with `counsel-imenu' or `counsel-org-goto' if in 'org-mode'."
       (interactive)
       (call-interactively
        (cond
         ((eq major-mode 'org-mode) 'counsel-org-goto)
         (t 'counsel-imenu))))

     (defun project-run-vterm (&optional arg)
       "Invoke `vterm' in the project's root.

     Switch to the project specific term buffer if it already exists.
     Use a prefix argument ARG to indicate creation of a new process instead."
       (interactive "P")
       (let* ((project (projectile-ensure-project (projectile-project-root)))
              (buffer (projectile-generate-process-name "vterm" arg)))
         (unless (buffer-live-p (get-buffer buffer))
           (unless (require 'vterm nil 'noerror)
             (error "Package 'vterm' is not available"))
           (projectile-with-default-dir project
             (vterm-other-window buffer)))
         (pop-to-buffer buffer)))

     (defun new-terminal ()
       "New a terminal in project root or the current directory."
       (interactive)
       (if (projectile-project-p)
           (project-run-vterm)
         (vterm-other-window)))

     (defun avy-jump-url ()
       "Use avy to go to url in the buffer."
       (interactive)
       (avy-jump "https?://"))
   #+end_src

** snippet
   #+begin_src emacs-lisp
     (defun load-yasnippet ()
       "Ensure yasnippet is enbled."
       (unless yas-global-mode (yas-global-mode 1))
       (yas-minor-mode 1))

     (defun ivy-yas ()
       "Lazy load ivy-yasnippet."
       (interactive)
       (load-yasnippet)
       (require 'ivy-yasnippet)
       (call-interactively 'ivy-yasnippet))
   #+end_src

** xwidget relevant functions
   #+begin_src emacs-lisp
     (defun google-search-action (x)
       "Search for X.
          force to make new session without using the original session."
       (xwidget-webkit-browse-url
        (concat
         (nth 2 (assoc counsel-search-engine counsel-search-engines-alist))
         (url-hexify-string x)) t))


     (defun google-search ()
       "Counsel-search with xwidget open url."
       (interactive)
       (require 'request)
       (require 'json)
       (let ((counsel-search-engine 'google))
         (ivy-read "search: "
                   #'counsel-search-function
                   :action #'google-search-action
                   :dynamic-collection t
                   :caller 'google-search)))

     (defun open-with-xwidget-action (x)
       (xwidget-webkit-browse-url
        (url-encode-url (concat
                         "file://"
                         (expand-file-name x ivy--directory))) t))

     (with-eval-after-load 'counsel
       (defun open-with-xwidget (&optional initial-input)
         "Open file with xwidget browse url."
         (interactive)
         (counsel--find-file-1 "Find file: "
                               initial-input
                               #'open-with-xwidget-action
                               'open-with-xwidget))

       ;; how to customize the tab behavior
       ;; add the open-with-xwidget in the alt-done alist
       (ivy-configure 'open-with-xwidget
         :parent 'read-file-name-internal
         :occur #'counsel-find-file-occur))
   #+end_src

** auto tangle literate config
   #+begin_src emacs-lisp :tangle no
     (defun my-tangle-literate-config ()
       "Auto call org-babel-tangle when saving the literate_setup.org"
       (when (string-equal (buffer-file-name) (expand-file-name "~/Desktop/spacemacs-private/mycraft/literate_setup.org"))

         (org-babel-tangle nil)))

     (add-hook 'after-save-hook #'my-tangle-literate-config)
   #+end_src

** operation with marked text

   #+begin_src emacs-lisp
     (defun send-text-and-move-to-projectile-vterm ()
       (interactive)
       (when (region-active-p)
         ;; get the mark content
         (let ((content (buffer-substring (region-beginning) (region-end))))
           (new-terminal)
           (deactivate-mark)
           (vterm-send-string content))))

   #+end_src

