mycraft/literate_setup.org
** search relevant functions

   My customize search function

   #+begin_src emacs-lisp
     (defun my-counsel-projectile-rg (&optional options)
       "Search the current project with rg and search under certarn directory
          if it's not in a project.

          OPTIONS, if non-nil, is a string containing additional options to
          be passed to rg. It is read from the minibuffer if the function
          is called with a prefix argument."
       (interactive)
       ;; change this to read a directory path
       (let* ((search-directory (if (projectile-project-p)
                                    (projectile-project-root)
                                  (read-directory-name "Start from directory: ")))
              (ivy--actions-list (copy-sequence ivy--actions-list))
              (ignored
               (mapconcat (lambda (i)
                            (concat "--glob !" (shell-quote-argument i)))
                          (append
                           (projectile--globally-ignored-file-suffixes-glob)
                           (projectile-ignored-files-rel)
                           (projectile-ignored-directories-rel))
                          " "))
              (counsel-rg-base-command
               (let ((counsel-ag-command counsel-rg-base-command))
                 (counsel--format-ag-command ignored "%s")))
              (initial-input (cond
                              ((use-region-p) (buffer-substring (region-beginning) (region-end)))
                              ((and (boundp 'ahs-current-overlay)
                                    (not (eq ahs-current-overlay nil))) (buffer-substring (overlay-start ahs-current-overlay)
                                    (overlay-end ahs-current-overlay)))
                              (t nil))))

         (when (region-active-p)
           (deactivate-mark))

         (ivy-add-actions
          'counsel-rg
          counsel-projectile-rg-extra-actions)

         (when (= (prefix-numeric-value current-prefix-arg) 4)
           (setq current-prefix-arg '(16)))

         (counsel-rg initial-input
                     search-directory
                     options
                     (projectile-prepend-project-name
                      (concat (car (if (listp counsel-rg-base-command)
                                       counsel-rg-base-command
                                     (split-string counsel-rg-base-command)))
                              ": ")))))

     (defun my-find-dotfile ()
       "Edit the `dotfile', in the current window."
       (interactive)
       (find-file-existing "~/Desktop/spacemacs-private/mycraft/init.el"))
   #+end_src
** yaml indent function
   #+begin_src emacs-lisp
     (defun my-yaml-indent-line ()
       "Indent the current line.
     The first time this command is used, the line will be indented to the
     maximum sensible indentation.  Each immediately subsequent usage will
     back-dent the line by `yaml-indent-offset' spaces.  On reaching column
     0, it will cycle back to the maximum sensible indentation."
       (interactive "*")
       (let ((ci (current-indentation))
             (cc (current-column))
             (need (yaml-compute-indentation)))
         (save-excursion
           (beginning-of-line)
           (delete-horizontal-space)
           (if (and (equal last-command this-command) (/= ci 0))
               (indent-to (* (/ (- ci 1) yaml-indent-offset) yaml-indent-offset))
             (indent-to need)))))
   #+end_src
** python relevant
   #+begin_src emacs-lisp
     (defvar python-run-command "python")
     (defvar python-run-args "")

     ;; TODO: implement this one
     (defun my-run-python ()
       "Use vterm to run python shell instead.
          Furthermore, using ipython instead if it's installed."
       (interactive)

       ;; create a vterm buffer with python shell
       ;; maybe, I can reference from the python-inferior-mode

       (if (featurep 'poetry)
           (vterm-send-string (poetry-virtualenv-path))
         (vterm-send-string "python"))
       (vterm-send-return))

     (defun python-run-main ()
       (interactive)
       (shell-command
        (format (concat python-run-command " %s %s")
                (shell-quote-argument (or (file-remote-p (buffer-file-name (buffer-base-buffer)) 'localname)
                                          (buffer-file-name (buffer-base-buffer))))
                python-run-args)))
   #+end_src
** golang relevant helper
   #+begin_src emacs-lisp
     (defvar go-test-command "go test")

     (defvar go-run-command "go run")
     (defvar go-run-args ""
       "Additional arguments to by supplied to `go run` during runtime.")

     (defun go-run-main ()
       (interactive)
       (shell-command
        (format (concat go-run-command " %s %s")
                (shell-quote-argument (or (file-remote-p (buffer-file-name (buffer-base-buffer)) 'localname)
                                          (buffer-file-name (buffer-base-buffer))))
                go-run-args)))
   #+end_src

* Initialize packages and setup hook

  Initialize package sources
  Note: sometimes you may encouter an expired key when
  downloading package. You need to fresh it.
  There are many ways to do it. One of them is call =list-package=
  Or delete the entire folder =elpa= make the emacs to redownload all packages.

** set up use-package
   The =:ensure= keyword causes the package(s) to be installed automatically
   if not already present on your system.
   =(setq use-package-always-ensure t)= will globally enable ensure to t.

   #+begin_src emacs-lisp :tangle no
     (require 'subr-x)
     (require 'package)
     (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                              ("org" . "https://orgmode.org/elpa/")
                              ("elpa" . "https://elpa.gnu.org/packages/")))

     (package-initialize)
     (unless package-archive-contents
       (package-refresh-contents))

     ;; Initialize use-package on non-Linux platforms
     (unless (package-installed-p 'use-package)
       (package-install 'use-package))

     (require 'use-package)

     (setq use-package-always-ensure t)
     ;;(setq use-package-verbose t)
     ;; this can show the package loaded info
   #+end_src

** try out straight.el

   #+begin_src emacs-lisp
     (setq straight-check-for-modifications nil)
     (defvar bootstrap-version)
     (let ((bootstrap-file
            (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
           (bootstrap-version 5))
       (unless (file-exists-p bootstrap-file)
         (with-current-buffer
             (url-retrieve-synchronously
              "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
              'silent 'inhibit-cookies)
           (goto-char (point-max))
           (eval-print-last-sexp)))
       (load bootstrap-file nil 'nomessage))

     ;; Always use straight to install on systems other than Linux
     (setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))

     ;; Use straight.el for use-package expressions
     (straight-use-package 'use-package)

     ;; Load the helper package for commands like `straight-x-clean-unused-repos'
     (require 'straight-x)
   #+end_src

** add additional load-path for use-package
   #+begin_src emacs-lisp
     (push (expand-file-name "~/Desktop/spacemacs-private/myemacs/local") load-path)
   #+end_src

** enable link in the comments can be click and highlight
   #+begin_src emacs-lisp
     (add-hook 'prog-mode-hook 'goto-address-prog-mode)
   #+end_src

** ensure program mode use space instead of tab

   #+begin_src emacs-lisp
     (add-hook 'prog-mode-hook #'(lambda () (setq indent-tabs-mode nil)))
   #+end_src

** delete trailing space when saving files
   #+begin_src emacs-lisp
     (add-hook 'before-save-hook 'delete-trailing-whitespace)
   #+end_src

** ensure auto refresh buffer for dired mode
   #+begin_src emacs-lisp
     (add-hook 'dired-mode-hook 'auto-revert-mode)
   #+end_src

** winner mode
   By default, you will not go back to the original window layout when you exit the ediff mode

   #+begin_src emacs-lisp
     (use-package winner
       :init
       (add-hook 'ediff-quit-hook 'winner-undo)
       :commands (winner-undo))
   #+end_src

** dired

   pres =S-RET= will perform dired-find-file-other-window

   #+begin_src emacs-lisp
     (use-package all-the-icons-dired
       :hook (dired-mode . all-the-icons-dired-mode)
       :config
       (setq all-the-icons-dired-monochrome nil)
       (set-face-attribute 'all-the-icons-dired-dir-face nil :foreground "#FF8822"))
   #+end_src

** esup
   a profiling tool for evaludating the performance of emacs' startup
   #+begin_src emacs-lisp
     (use-package esup
       :defer t
       :init
       (setq esup-depth 0))
   #+end_src

** svg-lib

   #+begin_src emacs-lisp
     (use-package svg-lib
       :defer 1
       :straight (svg-lib :type git :host github :files ("*.el") :repo "rougier/svg-lib"))
   #+end_src

** diminish
   #+begin_src emacs-lisp
     (use-package diminish :defer t)
   #+end_src

** command-log-mode
   this will log the keys you press in another buffer
   #+begin_src emacs-lisp
     (use-package command-log-mode
       :commands command-log-mode)
   #+end_src

** rainbow-mode
   #+begin_src emacs-lisp
     (use-package rainbow-mode
       :defer t)
   #+end_src

** rainbow-delimiters
   make parenthesis colorful and easier to distinguish
   #+begin_src emacs-lisp
     (use-package rainbow-delimiters
       :hook (prog-mode . rainbow-delimiters-mode))
   #+end_src

** highlight parentheses
   hightlight the current parenthesis' scope

   #+begin_src emacs-lisp
     (use-package highlight-parentheses
       :hook (prog-mode . highlight-parentheses-mode))
   #+end_src

