mycraft/init.el

(when (= (prefix-numeric-value current-prefix-arg) 4)
  (setq current-prefix-arg '(16)))

(defun my-counsel-projectile-rg (&optional options)
  "Search the current project with rg and search under certarn directory
     if it's not in a project.

     OPTIONS, if non-nil, is a string containing additional options to
     be passed to rg. It is read from the minibuffer if the function
     is called with a prefix argument."
  (interactive)
  ;; change this to read a directory path
  (let* ((search-directory (if (projectile-project-p)
                               (projectile-project-root)
                             (read-directory-name "Start from directory: ")))
         (ivy--actions-list (copy-sequence ivy--actions-list))
         (ignored
          (mapconcat (lambda (i)
                       (concat "--glob !" (shell-quote-argument i)))
                     (append
                      (projectile--globally-ignored-file-suffixes-glob)
                      (projectile-ignored-files-rel)
                      (projectile-ignored-directories-rel))
                     " "))
         (counsel-rg-base-command
          (let ((counsel-ag-command counsel-rg-base-command))
            (counsel--format-ag-command ignored "%s")))
         (initial-input (when (use-region-p) (buffer-substring (region-beginning) (region-end)))))

    (when (region-active-p)
          (deactivate-mark))

    (ivy-add-actions
     'counsel-rg
     counsel-projectile-rg-extra-actions)

    (when (= (prefix-numeric-value current-prefix-arg) 4)
      (setq current-prefix-arg '(16)))

    (counsel-rg initial-input
                search-directory
                options
                (projectile-prepend-project-name
                 (concat (car (if (listp counsel-rg-base-command)
                                  counsel-rg-base-command
                                (split-string counsel-rg-base-command)))
                         ": ")))))

(defun my-find-dotfile ()
  "Edit the `dotfile', in the current window."
  (interactive)
  (find-file-existing "~/Desktop/spacemacs-private/mycraft/init.el"))

(defun my-yaml-indent-line ()
  "Indent the current line.
The first time this command is used, the line will be indented to the
maximum sensible indentation.  Each immediately subsequent usage will
back-dent the line by `yaml-indent-offset' spaces.  On reaching column
0, it will cycle back to the maximum sensible indentation."
  (interactive "*")
  (let ((ci (current-indentation))
        (cc (current-column))
        (need (yaml-compute-indentation)))
    (save-excursion
      (beginning-of-line)
      (delete-horizontal-space)
      (if (and (equal last-command this-command) (/= ci 0))
          (indent-to (* (/ (- ci 1) yaml-indent-offset) yaml-indent-offset))
        (indent-to need)))))

(defvar python-run-command "python")
(defvar python-run-args "")

;; TODO: implement this one
(defun my-run-python ()
  "Use vterm to run python shell instead.
     Furthermore, using ipython instead if it's installed."
  (interactive)

  ;; create a vterm buffer with python shell
  ;; maybe, I can reference from the python-inferior-mode

  (if (featurep 'poetry)
      (vterm-send-string (poetry-virtualenv-path))
    (vterm-send-string "python"))
  (vterm-send-return))

(defun python-run-main ()
  (interactive)
  (shell-command
   (format (concat python-run-command " %s %s")
           (shell-quote-argument (or (file-remote-p (buffer-file-name (buffer-base-buffer)) 'localname)
                                     (buffer-file-name (buffer-base-buffer))))
           python-run-args)))

(defvar go-test-command "go test")

(defvar go-run-command "go run")
(defvar go-run-args ""
  "Additional arguments to by supplied to `go run` during runtime.")

(defun go-run-main ()
  (interactive)
  (shell-command
   (format (concat go-run-command " %s %s")
           (shell-quote-argument (or (file-remote-p (buffer-file-name (buffer-base-buffer)) 'localname)
                                     (buffer-file-name (buffer-base-buffer))))
           go-run-args)))

(require 'subr-x)
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)

(setq use-package-always-ensure t)

(push (expand-file-name "~/Desktop/spacemacs-private/myemacs/local") load-path)

(add-hook 'prog-mode-hook 'goto-address-prog-mode)

(add-hook 'prog-mode-hook '(lambda () (setq indent-tabs-mode nil)))

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(add-hook 'dired-mode-hook 'auto-revert-mode)

(use-package winner
  :init
  (add-hook 'ediff-quit-hook 'winner-undo)
  :commands (winner-undo))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  :config
  (set-face-attribute 'all-the-icons-dired-dir-face nil :foreground "#FF8822"))

(use-package esup
  :defer t
  :init
  (setq esup-depth 0)
  ;; To use MELPA Stable use ":pin mepla-stable",
  :pin melpa)

(use-package diminish :defer t)

(use-package rainbow-mode
  :defer t)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package highlight-parentheses
  :hook (prog-mode . highlight-parentheses-mode))
