mycraft/literate_setup.org
** doom-themes

   To install the following font for the alignment issue in org-table.
   https://github.com/be5invis/Sarasa-Gothic

   #+begin_src emacs-lisp
     (use-package doom-themes
       :init
       (load-theme 'doom-one t)
       (doom-themes-org-config)
       (set-face-attribute 'default nil :background "#292b2e")

       (with-eval-after-load 'org
         ;; change some ui
         (set-face-attribute 'org-link nil :font "Sarasa Mono SC" :foreground "#3f7c8f")
         (set-face-attribute 'org-level-2 nil :foreground "#6cd4ac")
         (set-face-attribute 'org-level-3 nil :foreground "#219e57")
         (set-face-attribute 'org-table nil :font "Sarasa Mono SC")
         (set-face-attribute 'org-agenda-date nil :foreground "#41918b")
         (set-face-attribute 'org-agenda-date-today nil :foreground "#118844")
         (set-face-attribute 'org-agenda-date-weekend nil :foreground "#cc3333")))

   #+end_src

** doom modeline
   #+begin_src emacs-lisp
     (use-package doom-modeline
       :config
       ;; (setq persp-show-modestring nil) this will disable showing the persp name in the modeline
       (doom-modeline-mode 1)
       (setq all-the-icons-scale-factor 1.1)
       :custom
       (doom-modeline-height 12)
       (doom-modeline-persp-name nil))
   #+end_src

** all-the-icons

   Maybe, you need to install this manually by the following commands.

   =M-x all-the-icons-install-fonts=

   #+begin_src emacs-lisp
     (use-package all-the-icons
       :defer 0)
   #+end_src

** polymode

   https://polymode.github.io/installation/

   #+begin_src emacs-lisp
     (use-package polymode
       :defer t)

     (use-package poly-ansible
       :defer t)
   #+end_src

** devdocs

   search thing under point [[https://devdocs.io/][devdocs]]

   #+begin_src emacs-lisp
     (use-package devdocs
       :defer t
       :commands (devdocs-search)
       :load-path "~/Desktop/spacemacs-private/myemacs/local/devdocs")

   #+end_src

** counsel-jq-yq

   #+begin_src emacs-lisp
     (use-package counsel-jq-yq
       :defer 1
       :straight (
                  :local-repo "~/Desktop/spacemacs-private/local/counsel-jq-yq"
                  )
       ;; :load-path "~/Desktop/spacemacs-private/local/counsel-jq-yq"
       ;; :config
       ;; (package-generate-autoloads "counsel-jq-yq" "~/Desktop/spacemacs-private/local/counsel-jq-yq")
       ;; (load-library "counsel-jq-yq-autoloads"))
       )
   #+end_src

** go-test
   #+begin_src emacs-lisp
     (use-package gotests
       :defer 1
       :straight (
                  :local-repo "~/Desktop/spacemacs-private/local/gotests"
                  )
       ;; the file with suffix -test will be treated as tests files by default
       ;; which will function as package files.
       ;; :load-path "~/Desktop/spacemacs-private/local/go-test"
       ;; :config
       ;; (package-generate-autoloads "go-test" "~/Desktop/spacemacs-private/local/go-test")
       ;; (load-library "go-test-autoloads")
       )
   #+end_src

** hl-todo mode

   TODO: https://github.com/coldnew/coldnew-emacs#highlight-fixme-todo

   #+begin_src emacs-lisp
     (use-package hl-todo
       :defer t
       :hook
       ;; (text-mode . hl-todo-mode) text-mode is the parent of org-mode
       (prog-mode . hl-todo-mode)
       :config
       (setq hl-todo-highlight-punctuation ":")
       (setq hl-todo-keyword-faces
             `(
               ("TODO" warning bold)
               ("FIXME" error bold)
               ("HACK" font-lock-constant-face bold)
               ("NOTE" success bold)
               ("BUG" error bold)
               ("DEPRECATED" font-lock-doc-face bold))))
   #+end_src

** diff-hl

   I've check this. It seems to set =magit-post-refresh-hook= is enough.

   #+begin_src emacs-lisp :tangle no
     (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh) ;; no need
   #+end_src

   #+begin_src emacs-lisp
     (use-package diff-hl
       :defer 1
       :init
       (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
       :config
       (global-diff-hl-mode))
   #+end_src

** perspective mode
   a workspace manager
   #+begin_src emacs-lisp
     (use-package perspective
       :diminish persp-mode
       :commands (persp-switch)
       :config
       (persp-mode))
   #+end_src

** which key mode
   a friendly key shortcut hint.
   #+begin_src emacs-lisp
     (use-package which-key
       :defer 0
       :diminish which-key-mode
       :config
       (setq which-key-idle-delay 0.05)
       (which-key-mode 1))
   #+end_src

** dictonary relevant packages
   there two package are not usable right now.
   #+begin_src emacs-lisp
     (use-package define-word
       :defer t)

     (use-package powerthesaurus
       :defer t)
   #+end_src

** notification

   #+begin_src emacs-lisp
     (use-package alert
       :commands alert
       :config
       (if (system-is-mac!)
           (setq alert-default-style 'osx-notifier)))
   #+end_src

** ebook reader
   #+begin_src emacs-lisp
     (use-package nov
       :defer t
       :mode ("\\.epub\\'" . nov-mode))
   #+end_src

** uuidgen
   #+begin_src emacs-lisp
     (use-package uuidgen
       :defer t)
   #+end_src

** docker
   #+begin_src emacs-lisp
     (use-package docker
       :defer t)

     (use-package docker-tramp
       :defer t)

     (use-package dockerfile-mode
       :defer t)
   #+end_src

** nginx
   #+begin_src emacs-lisp
     (use-package nginx-mode
       :defer t)
   #+end_src

** jsonnet-mode

   This is depended on the jsonnet binary.

   #+begin_src sh
     go get github.com/google/go-jsonnet/cmd/jsonnet
   #+end_src

   #+begin_src emacs-lisp
     (use-package jsonnet-mode
       :defer t)
   #+end_src

** conf-mode
   #+begin_src emacs-lisp
     (use-package conf-mode
       :defer t
       :mode ("poetry\\.lock" . conf-toml-mode))
   #+end_src

** jinja2-mode
   to research why there should append a suffix ='= for the mod
   the :config will be run after trigger autoload function
   change the tab behavior of jinja2 mode by =indent-line-function=

   #+begin_src emacs-lisp
     (use-package jinja2-mode
       :defer t
       :init
       (add-hook 'jinja2-mode-hook
                 #'(lambda ()
                     (set (make-local-variable 'indent-line-function) 'insert-tab)))
       :mode ("\\.j2\\'" . jinja2-mode))

   #+end_src

** makefile-mode

   makefile uses =tab= strictly to identify the target, and other things

    #+begin_src emacs-lisp
      (use-package make-mode
        :defer t
        :init
        (add-hook 'makefile-mode-hook
                  #'(lambda ()
                      (setq-local indent-tabs-mode t))))

   #+end_src

** racket-mode
   #+begin_src emacs-lisp
     (use-package racket-mode
       :defer t)
   #+end_src

** smartparens

   Decide to use this package to auto balance the parens
   NOTE: we should put hook in the =:init=
   If we put this in the =:config=, it will perform add these hook after lazy-loading.
   That means we will not get it auto turn on when we enter one of the following program mode

   =:init= before trigger
   =:config= after trigger

   #+begin_src emacs-lisp
     (use-package smartparens
       :defer 0
       :commands (smartparens-mode)
       :config
       (require 'smartparens-config)
       (add-hook 'js-mode-hook #'smartparens-mode)
       (add-hook 'go-mode-hook #'smartparens-mode)
       (add-hook 'html-mode-hook #'smartparens-mode)
       (add-hook 'python-mode-hook #'smartparens-mode)
       (add-hook 'emacs-lisp-mode-hook #'smartparens-mode))
   #+end_src

** yasnippet

   TODO: find a way to replace the hardcode path
   =(yas-reload-all)= will rebuild the snippets, This will be trigger when enable yas-xx-mode

   #+begin_src emacs-lisp
     (use-package yasnippet
       :defer 1
       :config
       (add-to-list 'yas-snippet-dirs "/Users/jing/Desktop/spacemacs-private/snippets")
       ;; (yas-global-mode 1)
       (yas-minor-mode 1))

     (use-package yasnippet-snippets
       :defer t
       :after yasnippet)

     (use-package ivy-yasnippet
       :defer t
       :after yaanippet)

   #+end_src

** helpful
   make help description more readble
   #+begin_src emacs-lisp
     (use-package helpful
       :custom
       (counsel-describe-function-function #'helpful-callable)
       (counsel-describe-variable-function #'helpful-variable)
       :bind
       ([remap describe-function] . counsel-describe-function)
       ([remap describe-command] . helpful-command)
       ([remap describe-variable] . counsel-describe-variable)
       ([remap describe-key] . helpful-key))
   #+end_src

** expand-region
   a convenient selection expander.

   #+begin_src emacs-lisp
     (use-package expand-region
       :commands
       (er--expand-region-1)
       :defer t)
   #+end_src

** winum
   #+begin_src emacs-lisp
     (use-package winum
       :defer 0
       :config
       (winum-mode))
   #+end_src

** systemd

   encounter an *issue: Company backend t could not be initialized*
   #+begin_src emacs-lisp
     (use-package systemd
       :defer t)
   #+end_src

** frontend development
   #+begin_src emacs-lisp
     (use-package emmet-mode
       :defer t
       :hook
       (html-mode . emmet-mode)
       (web-mode . emmet-mode))

     (use-package web-mode
       :defer t
       :mode
       (("\\.html\\'" . web-mode)))

     (use-package js2-mode
       :after (rainbow-delimiters)
       :defer t
       :config
       (setq js2-mode-show-parse-errors nil)
       (setq js2-mode-show-strict-warnings nil)
       (js2-minor-mode))
   #+end_src

** flycheck mode
   #+begin_src emacs-lisp
     (use-package flycheck
       :commands (flycheck-mode)
       :init
       (add-hook 'prog-mode-hook 'flycheck-mode)
       (add-hook 'text-mode-hook 'flycheck-mode)
       (setq flycheck-highlighting-mode 'lines)
       (setq flycheck-indication-mode 'nil))
   #+end_src

