mycraft/literate_setup.org
** json-mode & yaml-mode

   use =make-local-variable= to set buffer local variable.

   #+begin_src emacs-lisp
     (use-package json-mode
       :defer t)

     (use-package yaml-mode
       :defer t
       :mode (("\\.\\(yml\\|yaml\\)\\'" . yaml-mode)
              ("Procfile\\'" . yaml-mode))
       :init
       (add-hook 'yaml-mode-hook 'lsp)
       (add-hook 'yaml-mode-hook #'(lambda ()
                                     (set (make-local-variable 'tab-width) 2)
                                     (set (make-local-variable 'evil-shift-width) 2)
                                     (set (make-local-variable 'indent-line-function) 'my-yaml-indent-line)))
       :config
       ;; (with-eval-after-load 'evil
       ;;   (evil-define-key 'normal yaml-mode-map (kbd "=") 'yaml-indent-line))
       (with-eval-after-load 'flycheck
         (when (listp flycheck-global-modes)
           (add-to-list 'flycheck-global-modes 'yaml-mode))))
   #+end_src

   a quick way to find the path for value

   #+begin_src emacs-lisp
     (use-package json-snatcher
       :defer t)
   #+end_src

** cmake
   #+begin_src emacs-lisp
     (use-package cmake-mode
       :defer t
       :mode (("CMakeLists\\.txt\\'" . cmake-mode) ("\\.cmake\\'" . cmake-mode)))
   #+end_src

** lua
   #+begin_src emacs-lisp
     (use-package lua-mode
       :mode ("\\.lua\\'" . lua-mode)
       :defer t)
   #+end_src

** common lisp or emacs lisp

   TODO: maybe I neeed the better go to definition function like the spacemacs's implementation

   #+begin_src emacs-lisp
     (use-package slime
       :defer t
       :init
       (setq inferior-lisp-program "sbcl"))

     (use-package elisp-slime-nav
       :defer t
       :init
       (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
         (add-hook hook 'elisp-slime-nav-mode)))

     (use-package lispy
       :init
       (setq lispy-key-theme '(special c-digits))
       :hook ((common-lisp-mode . lispy-mode)
              (emacs-lisp-mode . lispy-mode)
              (scheme-mode . lispy-mode))
       :config
       (with-eval-after-load 'evil-matchit
         (lispy-define-key lispy-mode-map (kbd "%") 'lispy-different)
         (lispy-define-key lispy-mode-map (kbd "d") 'lispy-kill)))

   #+end_src

** rust mode
   #+begin_src emacs-lisp
     (use-package rust-mode
       :defer t
       :mode "\\.rs\\'"
       :init (setq rust-format-on-save t))

     (use-package cargo
       :defer t)

   #+end_src

** go mode
   #+begin_src emacs-lisp
     (use-package go-mode
       :defer 2
       :config
       (progn
         (setq gofmt-command "goimports")
         (add-hook 'before-save-hook 'gofmt-before-save)))

     (use-package protobuf-mode
       :defer t)

     (use-package gomacro-mode
       :hook (go-mode . gomacro-mode))
   #+end_src

** python mode

   This is a basic setup for python language.

   #+begin_src emacs-lisp
     (with-eval-after-load 'python
       (setq python-shell-interpreter "ipython"))

     (use-package python-pytest
       :defer t
       :custom
       (python-pytest-confirm t))

     (use-package poetry
       :defer t)

     (use-package pyvenv
       :commands (pyvenv-mode)
       :init
       (add-hook 'python-mode-hook #'pyvenv-mode))

     (use-package pyimport
       :defer t
       :init
       (add-hook 'before-save-hook 'pyimport-remove-unused))

     (use-package cython-mode
       :defer t)
   #+end_src

** dumb-jump

   a jump to definition with search tool (ag, rg)

   #+begin_src emacs-lisp
     (use-package dumb-jump
       :init
       (setq dumb-jump-selector 'ivy)
       :defer t)
   #+end_src

** lsp mode

   run =company-diag= to check what the company-backen is being used.
   =(setq lsp-keymap-prefix "SPC m")= this will only affect the display info of whichkey.


   If you want a breadcrumb to hint current position, add the following setting.
   #+begin_src emacs-lisp :tangle no
     (lsp-mode . (lambda () (lsp-headerline-breadcrumb-mode)))
   #+end_src

   #+begin_src emacs-lisp
     (use-package lsp-mode
       :init
       (setq lsp-completion-provider :capf) ;; the official recommends use this
       (setq lsp-enable-symbol-highlighting nil)
       (setq lsp-signature-render-documentation nil)
       (setq read-process-output-max (* 1024 1024))
       ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
       :commands
       (lsp)
       :hook
       (go-mode . lsp)
       (python-mode . lsp)
       (rust-mode . lsp)
       (js-mode . lsp)
       (c-mode . lsp)
       (c++-mode . lsp)
       :config
       ;; turn off lens mode
       (setq lsp-lens-enable nil)
       (setq lsp-headerline-breadcrumb-enable nil)
       (setq lsp-enable-folding nil)
       (setq lsp-enable-snippet nil)
       (setq lsp-enable-imenu nil)
       (setq lsp-enable-links nil))

     (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

     (use-package dap-mode
       :defer t
       :config
       ;; pip install "ptvsd>=4.2"
       (require 'dap-python)
       (require 'dap-go)
       ;; dap-go-setup
       (add-hook 'dap-stopped-hook
                 (lambda (arg) (call-interactively #'dap-hydra))))
   #+end_src

   #+begin_src emacs-lisp :tangle no
     (use-package lsp-python-ms
       :after
       (lsp-mode)
       :init
       (setq lsp-python-ms-auto-install-server t))
   #+end_src

   in the beginning, you may need to install the pyright server manually
   commands: lsp install server: pyright

   #+begin_src emacs-lisp
     (use-package lsp-pyright
       :defer t
       :custom ((lsp-pyright-multi-root nil))
       :hook (python-mode . (lambda ()
                              (require 'lsp-pyright)
                              (lsp))))

   #+end_src

   currently, disable =lsp-ui=

   #+begin_src emacs-lisp :tangle no
     (use-package lsp-ui
       :after flycheck
       :commands lsp-ui-mode
       :config
       (setq lsp-ui-doc-enable nil)
       (setq lsp-ui-sideline-enable nil))
   #+end_src

** ivy & swiper & counsel

   =(setq ivy-use-selectable-prompt t)=
   to make the candidate you typed selectable. This is useful when you call =counsel-find-file=.
   Ex. You can choose the bar.yml when there is a candidate named barfar.yml

   =(setq ivy-initial-inputs-alist nil)=
   let the input in the ivy-minibuffer empty when opening the it.


   #+begin_src emacs-lisp
     (use-package ivy
       :ensure t
       :diminish
       :bind (:map ivy-minibuffer-map
                   ("TAB" . ivy-alt-done)
                   ("C-l" . ivy-alt-done)
                   ("C-j" . ivy-next-line)
                   ("C-k" . ivy-previous-line)
                   ("C-u" . ivy-backward-kill-word)
                   :map ivy-switch-buffer-map
                   ("C-k" . ivy-previous-line)
                   ("C-l" . ivy-done)
                   ("C-d" . ivy-switch-buffer-kill)
                   :map ivy-reverse-i-search-map
                   ("C-k" . ivy-previous-line)
                   ("C-d" . ivy-reverse-i-search-kill))
       :config
       (ivy-mode 1)
       (setq ivy-more-chars-alist '((t . 2))) ;; set the char limit when searching with ivy
       (setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
       (setq ivy-use-selectable-prompt t)
       ;; (setq ivy-dynamic-exhibit-delay-ms 250)
       (setq ivy-initial-inputs-alist nil)
       (with-eval-after-load 'evil
         (define-key ivy-occur-grep-mode-map (kbd "w") nil)
         (evil-define-key 'normal ivy-occur-grep-mode-map
           (kbd "i")
           #'(lambda ()
               (interactive)
               (ivy-wgrep-change-to-wgrep-mode)
               (evil-insert-state)))))

     (use-package ivy-rich
       :after (ivy)
       :init
       (ivy-rich-mode 1))
   #+end_src

   After calling =swiper=, =counsel search=, ivy-occur (C-c C-o) will get all the candidates in another buffer.
   Then we can enter edit mode by ivy-wgrep-change-to-wgrep-mode (C-x C-q)

   Use =multiple-cursor= may be helpful here.
   Finally, =Ctrl-c Ctrl-c= to commit change
   there are some key binding in the swiper-map

   #+begin_src emacs-lisp
     (use-package swiper
       :bind (("C-s" . swiper)))
   #+end_src

   #+begin_src emacs-lisp
     (use-package counsel
       :bind (("M-x" . counsel-M-x)
              ("C-x b" . counsel-ibuffer)
              ("C-x C-f" . counsel-find-file)
              :map minibuffer-local-map
              ("C-w" . 'ivy-backward-kill-word)
              :map ivy-minibuffer-map
              ("C-w" . 'ivy-backward-kill-word)
              ("C-r" . 'counsel-minibuffer-history))
       :config
       (setq counsel-find-file-at-point t))

     ;; counsel-search will use the package request with this function
     (use-package request
       :defer t)

   #+end_src

** projectile
   #+begin_src emacs-lisp
     (use-package projectile
       :defer 1
       :custom ((projectile-completion-system 'ivy))
       :config
       (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
       (add-to-list 'projectile-project-root-files-bottom-up "pyproject.toml")
       (projectile-mode +1))

     (use-package counsel-projectile
       :after projectile
       :defer 1
       :config (counsel-projectile-mode))
   #+end_src

** avy
   =(setq avy-background t)= will diminish the background to make the target clearly.

   #+begin_src emacs-lisp
     (use-package avy
       :defer t
       :config
       (setq avy-background t))

   #+end_src

** vterm

   Failed to install vterm: https://melpa.org/packages/vterm-20200926.1215.tar: Not found
   =package-refresh-contents=

   Optional, you can send additional string and perform it after vterm open

   #+begin_src emacs-lisp :tangle no
     (add-hook 'vterm-mode-hook (lambda ()
                                  (vterm-send-string "source ~/.bash_profile")
                                  (vterm-send-return)
                                  (evil-emacs-state)))
   #+end_src

   #+begin_src emacs-lisp
     (use-package vterm
       :defer t
       :init
       (setq vterm-always-compile-module t)
       (setq vterm-timer-delay 0.05)
       (with-eval-after-load 'evil
         (evil-set-initial-state 'vterm-mode 'emacs))
       :config
       (define-key vterm-mode-map (kbd "<escape>") 'vterm-send-escape))
   #+end_src

   #+begin_src emacs-lisp
     (use-package vterm-toggle
       :defer t)
   #+end_src

** ediff

   #+begin_src emacs-lisp
     (use-package ediff
       :defer t
       :init
       (setq ediff-window-setup-function 'ediff-setup-windows-plain)
       (setq ediff-split-window-function 'split-window-horizontally))
   #+end_src

