mycraft/literate_setup.org
** evil
   it's evil! provide you vim-like ux in emacs.

   #+begin_src emacs-lisp
     (use-package evil
       :defer 0
       :init
       (setq evil-want-keybinding nil) ;; this will cause some evil keybinding
       ;; of other modes not working when it's set to true
       :config
       (setq evil-want-integration t)
       (setq evil-want-C-u-scroll t)
       (setq evil-want-C-i-jump nil)
       (evil-mode 1)
       (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
       ;; Use visual line motions even outside of visual-line-mode buffers
       (evil-define-key 'normal prog-mode-map (kbd "C-j") 'evil-scroll-line-down)
       (evil-define-key 'normal prog-mode-map (kbd "C-k") 'evil-scroll-line-up)
       (evil-define-key 'normal prog-mode-map (kbd "g h") 'flycheck-display-error-at-point)


       (evil-global-set-key 'motion "j" 'evil-next-visual-line)
       (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

       (evil-set-initial-state 'messages-buffer-mode 'normal)
       (evil-set-initial-state 'dashboard-mode 'normal)

       (add-hook 'evil-normal-state-entry-hook 'im-use-eng)
       (add-hook 'evil-insert-state-entry-hook 'im-use-prev)
       (add-hook 'evil-insert-state-exit-hook 'im-remember)
       (add-hook 'evil-emacs-state-entry-hook 'im-use-eng))
   #+end_src

   evil-matchit  make =%= to be able to jump to and back the tag
   evil-collection provides some pre-defined evil key binding for other-modes.

   #+begin_src emacs-lisp
     (use-package evil-matchit
       :after evil
       :config
       (global-evil-matchit-mode 1))

     (use-package evil-collection
       :after evil
       :config
       (delete 'wgrep evil-collection-mode-list)
       (delete 'vterm evil-collection-mode-list)
       (delete 'lispy evil-collection-mode-list)
       (delete 'ivy evil-collection-mode-list)
       (delete 'view evil-collection-mode-list)
       ;; this will bind a global esc key for minibuffer-keyboard-quit so I remove it.
       (setq evil-collection-company-use-tng nil)
       (add-hook 'evil-collection-setup-hook #'(lambda (_mode mode-keymaps &rest _rest)
                                                 (when (eq _mode 'docker)
                                                   (evil-define-key 'normal 'docker-container-mode-map (kbd "b") 'docker-container-vterm))))
       (evil-collection-init))
   #+end_src

   evil-nerd-commenter provide the quick comment util functions.

   #+begin_src emacs-lisp
     (use-package evil-nerd-commenter
       :after evil
       :commands evilnc-comment-operator
       :init
       (define-key evil-normal-state-map "gc" 'evilnc-comment-operator))

     (use-package evil-surround
       :after evil
       :config
       (global-evil-surround-mode 1))
   #+end_src

** wgrep mode
   #+begin_src emacs-lisp
     (use-package wgrep
       :after evil
       :commands
       (wgrep-finish-edit
        wgrep-finish-edit
        wgrep-abort-changes
        wgrep-abort-changes)
       :init
       (evil-define-key 'normal wgrep-mode-map (kbd "<escape>") 'wgrep-exit)
       (evil-define-key 'normal wgrep-mode-map (kbd ", ,") 'wgrep-finish-edit)
       (evil-define-key 'normal wgrep-mode-map (kbd ", k") 'wgrep-abort-changes))
   #+end_src

** code folding

   #+begin_src emacs-lisp
     (use-package hideshow
       :commands
       (hs-toggle-hiding
        hs-hide-block
        hs-hide-level
        hs-show-all
        hs-hide-all))
   #+end_src


   create arbitrary fold not like other package auto detect the program language

   #+begin_src emacs-lisp
     (use-package vimish-fold
       :after evil
       :hook (prog-mode . vimish-fold-mode))

     (use-package evil-vimish-fold
       :after vimish-fold
       :hook (prog-mode . evil-vimish-fold-mode))
   #+end_src

** multiple-cursors
   it will save the command behavior applied on the multiple cursor to a file named .mc-lists.el.
   By default, it's path is =~/.emacs.d/.mc-lists.el= and I customize the storing path already.
   Research how evil-mc customize the multiple-cursor

   #+begin_src emacs-lisp
     (use-package multiple-cursors
       :init
       (global-set-key (kbd "C-S-a") 'mc/edit-lines)
       (global-set-key (kbd "C-S-<down-mouse-1>") 'mc/add-cursor-on-click)
       (global-set-key (kbd "<C-S-right>") 'mc/mark-next-like-this)
       (global-set-key (kbd "<C-S-left>") 'mc/mark-previous-like-this)
       :commands
       (mc/edit-lines
        mc/mark-all-like-this
        mc/add-cursor-on-click
        mc/mark-next-like-this
        mc/mark-previous-like-this))
   #+end_src

   #+begin_src emacs-lisp
     (use-package iedit
       :commands
       (iedit-restrict-region)
       :config
       (define-key iedit-occurrence-keymap-default
         (kbd "<escape>") #'(lambda () (interactive) (iedit-mode -1))))
   #+end_src

** git version control

   ENHANCE: adjust the pop ui
   #+begin_src emacs-lisp
     (use-package git-messenger
       :defer t
       :init
       (setq git-messenger:show-detail t)
       (setq git-messenger:use-magit-popup t))

     (use-package magit
       :defer 2
       :custom
       ((magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
        (magit-repository-directories
         '(("~/Desktop/data_platform" . 1)
           ("~/Desktop/cdp-cache" . 1)
           ("~/Desktop/ansible-playground" . 1)
           ("~/Desktop/go-playground" . 1)
           ("~/Desktop/spacemacs-private" . 1)))))

     (use-package forge
       :defer 2
       :after magit)

   #+end_src

** auto-highlight-symbol

   Only the mode appears in the =ahs-plugin-bod-modes= can use beginning of the defun plugin

   #+begin_src emacs-lisp
     (use-package auto-highlight-symbol
       :commands
       (ahs-forward
        ahs-unhighlight
        ahs-change-range
        ahs-change-range-internal
        ahs-dropdown-list-p
        ash-backward)
       :config
       (setq ahs-case-fold-search nil)
       (add-to-list 'ahs-plugin-bod-modes 'python-mode))
   #+end_src

