mycraft/init.el

(use-package hydra
  :defer t)

(defhydra window-operate ()
  "
Window management :)
^Resize^               ^select^
^^^^           ^^^^
[_[_] : shrink h        [_h_]: left
[_]_] : enlarge h       [_l_]: right
[_{_] : shrink v        [_k_]: up
[_}_] : enlarge v       [_j_]: down
[_=_] : balance         [_1_.._9_]: window 1..9
[_m_] : window maximize
"
  ("[" my-shrink-window-horizontally nil)
  ("]" my-enlarge-window-horizontally nil)
  ("{" my-shrink-window nil)
  ("}" my-enlarge-window nil)
  ("=" balance-windows nil)
  ("m" toggle-maximize-buffer nil)
  ("h" evil-window-left nil)
  ("l" evil-window-right nil)
  ("k" evil-window-up nil)
  ("j" evil-window-down nil)
  ("1" winum-select-window-1 nil)
  ("2" winum-select-window-2 nil)
  ("3" winum-select-window-3 nil)
  ("4" winum-select-window-4 nil)
  ("5" winum-select-window-5 nil)
  ("6" winum-select-window-6 nil)
  ("7" winum-select-window-7 nil)
  ("8" winum-select-window-8 nil)
  ("9" winum-select-window-9 nil))

(defhydra hydra-text-scale (:timeout 8)
  "scale text"
  ("j" text-scale-increase "+")
  ("k" text-scale-decrease "-")
  ("0" ((lambda (inc) (text-scale-adjust inc)) 0) "reset")
  ("<escape>" nil "finished" :exit t))

(defhydra hydra-mode-toggle ()
  "toggle mode"
  ("r" rainbow-mode "rainbow mode")
  ("w" whitespace-mode "whitespace-mode")
  ("t" counsel-load-theme "theme")
  ("v" visual-line-mode "visual line mode")
  ("f" flyspell-mode "check spell"))

(setq ahs-default-range 'ahs-range-whole-buffer)

(defun my-ahs-highlight-p ()
  "Ruturn Non-nil if symbols can be highlighted."
  (interactive)
  (let* ((beg (if (region-active-p) (region-beginning) (overlay-start ahs-current-overlay)))
         (end (if (region-active-p) (region-end) (overlay-end ahs-current-overlay)))
         (face (get-text-property beg 'face))
         (symbol (buffer-substring beg end)))

    (when (and (boundp 'ahs-highlighted)
               ahs-highlighted)
      (ahs-unhighlight t))
    (when (and symbol
               (not (ahs-dropdown-list-p))
               (not (ahs-face-p (ahs-add-overlay-face beg face) 'ahs-inhibit-face-list))
               (not (ahs-symbol-p ahs-exclude symbol t))
               (ahs-symbol-p ahs-include symbol))
      (list symbol beg end))))

(defun my-ahs-search-symbol (symbol search-range)
  "Search `SYMBOL' in `SEARCH-RANGE'."
  (save-excursion
    (let ((case-fold-search ahs-case-fold-search)
          ;; (regexp (concat "\\_<\\(" (regexp-quote symbol) "\\)\\_>" ))
          (regexp (regexp-quote symbol))
          (beg (car search-range))
          (end (cdr search-range)))
      (goto-char end)
      (while (re-search-backward regexp beg t)
        (let* ((symbol-beg (match-beginning 0))
               (symbol-end (match-end 0))
               (tprop (text-properties-at symbol-beg))
               (face (cadr (memq 'face tprop)))
               (fontified (cadr (memq 'fontified tprop))))
          (unless (or face fontified)
            (setq ahs-need-fontify t))
          (push (list symbol-beg
                      symbol-end
                      face fontified) ahs-search-work))))))

(advice-add 'ahs-search-symbol :override #'my-ahs-search-symbol)

(defun expand-and-highlight-region ()
  (interactive)
  (er--expand-region-1)
  (highlight-region))

(defun contract-and-highlight-region ()
  (interactive)
  (call-interactively 'er/contract-region)
  (highlight-region))


(defun highlight-region ()
  (interactive)
  (let ((hh (my-ahs-highlight-p)))
    (unless ahs-current-range
      (ahs-change-range-internal ahs-default-range))
    (when hh
      (ahs-highlight (nth 0 hh)
                     (nth 1 hh)
                     (nth 2 hh)))))

(defhydra mark-operation ()
  "\nSwift knife %s(propertize (format \" %s \" (ahs-current-plugin-prop 'name)) 'face  (ahs-current-plugin-prop 'face))

 ^match^                    ^Search^                     ^edit^
^^^^              ^^^^                 ^^^^
_v_: expand               _s_: swiper                  _e_: iedit
_-_: contract             _/_: counsel-projectile-rg   _h_: highlight
_r_: range
_n_: next
_N_: prev
"
  ("v" expand-and-highlight-region nil)
  ("-" contract-and-highlight-region nil)
  ;; counsel-projectile-rg-initial-input
  ("s" swiper-thing-at-point nil)
  ("/" my-counsel-projectile-rg nil)
  ("e" iedit-mode nil)
  ("h" highlight-region nil)
  ("r" my-change-range nil)
  ("n" my-ahs-forward nil)
  ("N" my-ahs-backward nil))

(defun my-change-range ()
  (interactive)
  (setq range (ahs-runnable-plugins t))
  (ahs-change-range-internal range)
  (highlight-region))

(defun my-ahs-forward ()
  (interactive)
  (when (region-active-p)
    (deactivate-mark))
  (ahs-forward))

(defun my-ahs-backward ()
  (interactive)
  (when (region-active-p)
    (deactivate-mark))
  (ahs-backward))

(with-eval-after-load 'auto-highlight-symbol
  (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-change-range)
  (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-ahs-backward)
  (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-ahs-forward))

(defun wrap-mark-operation()
  (interactive)
  (er--expand-region-1)
  (highlight-region)
  (mark-operation/body))

(with-eval-after-load 'evil
  (evil-define-key 'normal 'evil-motion-state-map
    (kbd "*") 'wrap-mark-operation))
