mycraft/init.el

(use-package company
  :config
  (setq company-minimum-prefix-length 2)
  (setq company-idle-delay 0.1)
  ;; In evil-collection, it adjust the key binding for the company-mode
  ;; NOTE: Furthermore, it also disable the pre-select behavior when
  ;; showing the completion candidates.
  (define-key company-active-map (kbd "<return>") 'company-complete-selection)
  (global-company-mode 1))

(use-package org-ql
  :defer t)

(use-package org
  :defer t
  :ensure org-plus-contrib
  :pin org)

(use-package org-download
  :commands
  (org-download-screenshot
   org-download-clipboard)
  :defer t)

(use-package org-journal
  :defer t)

(use-package ox-reveal
  :after org)

(use-package org-superstar
  :hook (org-mode . org-superstar-mode))

(use-package visual-fill-column
  :init
  (setq visual-fill-column-width 150)
  (setq visual-fill-column-center-text t)
  :hook (org-mode . org-mode-visual-fill))

(use-package htmlize
  :defer t)

(use-package toc-org
  :defer t
  :init
  (add-hook 'org-mode-hook 'toc-org-mode)
  (add-hook 'markdown-mode-hook 'toc-org-mode)
  :commands (toc-org-insert-toc))

(use-package evil-org
  :after org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme))))

(use-package restclient
  :defer t)

(use-package ob-restclient
  :defer t
  :after (org restclient)
  :init (add-to-list 'org-babel-load-languages '(restclient . t)))

(with-eval-after-load 'org
