mycraft/literate_setup.org
*** org configuration

    example settings for org-agenda-files
    #+begin_example
    (setq org-agenda-files (file-expand-wildcards "~/Dropbox/myorgs/*.org"))
    (setq org-agenda-files (directory-files-recursively "~/Dropbox/myorgs/" "\\.org$"))
    #+end_example


    #+begin_src emacs-lisp
      (with-eval-after-load 'org
        (org-babel-do-load-languages
         'org-babel-load-languages
         '((emacs-lisp . t)
           (shell . t)
           (dot . t)
           (sql . t)
           (python . t)))

        (add-to-list 'org-structure-template-alist '("sel" . "src emacs-lisp"))
        (add-to-list 'org-structure-template-alist '("sb" . "src bash"))
        (add-to-list 'org-structure-template-alist '("sp" . "src python"))

        ;; to produce font-face for org quote block
        (setq org-fontify-quote-and-verse-blocks t)

        (setq org-hide-emphasis-markers t)
        ;; hide the empasis syntax ex. *hi* -> bold hi

        (setq org-adapt-indentation t) ;; use indent-line-function to
        ;; see the indentation function used by org-mode
        ;; check the doc of org-indent-line, know how indent works

        (set-face-attribute 'org-block nil :background "#202021")
        (set-face-attribute 'org-quote nil :background "#202021")

        (setq org-export-backends '(ascii html icalendar latex odt md))
        (setq-default safe-local-variable-values '((org-reveal-ignore-speaker-notes)
                                                   (org-confirm-babel-evaluate)
                                                   (org-export-babel-evaluate)))

        ;; set org table's font
        ;; (set-face-font 'org-table " ")
        ;; I use the visual-column instead
        ;; (add-hook 'org-mode-hook 'toggle-word-wrap)

        ;; Set faces for heading levels
        (dolist (face '((org-document-title . 1.5)
                        (org-level-1 . 1.3)
                        (org-level-2 . 1.2)
                        (org-level-3 . 1.15)
                        (org-level-4 . 1)
                        (org-level-5 . 1)
                        (org-level-6 . 1)
                        (org-level-7 . 1)
                        (org-level-8 . 1)))
          (set-face-attribute (car face) nil :font "Source Code Pro" :weight 'regular :height (cdr face)))

        ;; NOTE:
        ;; (setq org-format-latex-options
        ;;        (list :foreground 'default
        ;;              :background 'default
        ;;              :scale 1.5
        ;;              :html-foreground "Black"
        ;;              :html-background "Transparent"
        ;;              :html-scale 1.0
        ;;              :matchers '("begin" "$1" "$" "$$" "\\(" "\\[")))

        ;; this will make org-shift to auto add timestamp after making a toto item complete
        (setq org-log-done 'time)
        (setq org-startup-truncated nil)
        (setq org-image-actual-width nil)
        (setq org-src-window-setup 'current-window) ;; org-edit-src without prompting window
        (setq org-agenda-use-tag-inheritance nil)

        (setq org-startup-folded t)
        ;; (setq org-ellipsis " ")
        (setq org-startup-with-inline-images t)
        (setq-default org-default-notes-file
                      "~/Dropbox/myorgs/todo.org")

        (setq org-download-screenshot-method "screencapture -i %s")
        (setq-default org-download-image-dir "./img")
        (setq org-download-image-org-width 500)

        (setq org-journal-dir "~/Dropbox/myorgs/journal/")
        (setq org-journal-file-type 'weekly)
        (setq org-journal-file-format "%Y-%m-%W.org")

        (setq org-agenda-files (split-string (shell-command-to-string "find ~/Dropbox/myorgs -type f | grep '.*.org$' | grep -E -v 'presentation/|journal/'") "\n" t))

        ;; to config the org refile
        (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
        (setq org-refile-use-outline-path 'file)
        (setq org-outline-path-complete-in-steps nil)

        ;; to allow creating a new heading when performing the org refile
        (setq org-refile-allow-creating-parent-nodes 'confirm)

        ;; cool! some functions need to be enable
        ;; like <s press tab to complete org structure
        ;; these variables can be found in the source code of org.el
        (setq org-modules '(ol-w3m
                            ol-bbdb
                            ol-bibtex
                            ol-docview
                            ol-gnus
                            ol-info
                            ol-irc
                            ol-mhe
                            ol-rmail
                            ol-eww
                            org-habit
                            ol-git-link
                            org-protocol
                            org-tempo))

        ;; customize the bullet symbol
        (custom-set-variables '(org-bullets-bullet-list (quote ("" "" "" ""))))
        (setq org-superstar-headline-bullets-list (quote ("" "" "" "")))
        (setq org-hide-leading-stars t)

        ;; to customize the org-capture template and clear the template before
        ;; we add the template in the list.
        (setq org-capture-templates nil)

        (setq org-todo-keywords
              '((sequence "TODO" "IN PROGRESS" "|" "DONE" "PRESERVE")))

        (setq org-todo-keyword-faces
              '(("TODO" . "#dc752f")
                ("IN PROGRESS" . "#33eecc")
                ("NO_NEWS" . "#cdb7b5")
                ("ABANDON" . "#f2241f")
                ("OFFERGET" . "#4f97d7")))


        ;; in order to group the templates we need to add the key-description
        ;; pair first or it will not work
        (add-to-list 'org-capture-templates '("i" "Inbox"))
        (add-to-list 'org-capture-templates
                     '("im" "Misc Inbox" entry
                       (file+headline "~/Dropbox/myorgs/inbox.org" "Misc")
                       "** %^{title} %?\n %(current-kill 0)\n\n"))

        (add-to-list 'org-capture-templates '("b" "Bookmarks"))
        (add-to-list 'org-capture-templates
                     '("bb" "Blogs bookmarks" entry
                       (file+headline "~/Dropbox/myorgs/bookmarks.org" "Blogs")
                       "** %^{title} %?\n %(current-kill 0)\n\n"))
        (add-to-list 'org-capture-templates
                     '("bs" "Speeches bookmarks" checkitem
                       (file+headline "~/Dropbox/myorgs/bookmarks.org" "Speeches")
                       "- [ ] [[%(current-kill 0)][%^{link description}]]\n"))

        (add-to-list 'org-capture-templates '("t" "Todos"))
        (add-to-list 'org-capture-templates
                     '("td" "a one day todo" entry
                       (file+headline "~/Dropbox/myorgs/todo.org" "")
                       "** TODO %^{title} %?\n SCHEDULED: %^t\n%? "))
        (add-to-list 'org-capture-templates
                     '("tw" "a week todo" entry
                       (file+headline "~/Dropbox/myorgs/todo.org" "")
                       "** TODO %^{title} %?\n SCHEDULED: %t\n"))
        (add-to-list 'org-capture-templates
                     '("tl" "a longterm todo" entry
                       (file+headline "~/Dropbox/myorgs/todo.org" "")
                       "** TODO %^{title} %?\n SCHEDULED: %t\n")))
    #+end_src

* Some key binding

  prevent prompting in minibuffer, just quit the command
  #+begin_src emacs-lisp
    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    (with-eval-after-load 'evil
      (evil-define-key 'emacs 'global (kbd "M-b") 'buffer-operate/body)
      (evil-define-key 'emacs 'global (kbd "M-w") 'window-operate/body))


    (use-package table
      :defer 0
      :config
      (unless table-cell-map
        (table--make-cell-map))
      (define-key table-cell-map (kbd "<return>") '*table--cell-newline-and-indent)
      (with-eval-after-load 'evil
        (evil-define-key 'normal table-cell-map (kbd "x") '*table--cell-delete-char)
        (evil-define-key 'normal table-cell-map (kbd "p") '*table--cell-yank)
        (evil-define-key 'normal table-cell-map (kbd "d") '*table--cell-delete-region)
        (evil-define-key 'normal table-cell-map (kbd ".") 'hydra-table-mode/body)))

  #+end_src

* Tips
  if you don't want some block to be exported, then you can add =:tangle no= onto src clock

  ex.
  #+begin_src emacs-lisp :tangle no
    (message "hi")
  #+end_src
